/* Generated by StringsEditor */

"切换服务" = "Services";

"代理设置" = "Proxy Settings";

"不修改系统代理设置" = "Don't Modify System Proxy";

"作为系统全局代理" = "Use as System Global Proxy";

"使用“自动代理配置（PAC）”" = "Use \"Automatic Proxy Configuration (PAC)\"";

"显示主窗口" = "Show Main Window";

"检查更新..." = "Check Updates...";

"关于 GoAgentX" = "About GoAgentX";

"退出" = "Quit";

"状态" = "Status";

"服务配置" = "Services Configuration";

"其他设置" = "Other Settings";

"本地端口：" = "Local Port:";

"分享给局域网使用" = "Share Service to Local Network";

"服务器 App ID：" = "Server App ID:";

"填写您的 App Engine ID，多个用坚线“|”隔开" = "Fill your App Engine ID, seperate by \"|\" if have multiple App IDs";

"使用 PHP Fetch，上面的地址填 PHP 服务地址" = "Use PHP Fetch, fill PHP service address above";

"服务密码：" = "Service Password:";

"如果设置了服务密码，请填写" = "Fill service password if you set it";

"启用混淆，需要服务端版本 >= 2.1.17" = "Enable obfuscate, needs server version >= 2.1.17";

"连接模式：" = "Connect Mode:";

"HTTPS 保密性更好，但速度较慢" = "HTTPS has more secruity, but slower";

"选择服务器：" = "Server Host:";

"如果使用 CN 无法连接，可以尝试 HK" = " ";

"使用代理服务器" = "Use Secondary Proxy";

"代理服务器：" = "Proxy Server:";

"代理服务器端口：" = "Proxy Port:";

"代理服务器的地址" = "Proxy Server Address";

"代理服务器的端口，例如 8080" = "Proxy Server Port, such as 8080";

"用户名：" = "Username:";

"代理服务器的用户名，可不填" = "Proxy Server Username, optional";

"密码：" = "Password:";

"代理服务器的密码，可不填" = "Proxy Server Password, optional";

"您在 App Engine 申请的 App ID，多个以 | 分隔" = "The App IDs applied on App Engine, seperate with | if have multiple";

"您的 App Engine 账户的邮件地址" = "Your App Engine account's email";

"您的 App Engine 账户的密码" = "Your App Engine account's password";

"如果想防止 goagent 被匿名使用，可以设置密码，建议设置" = "Recommend for avoiding goagent used by other peoples";

"类型：" = "Types:";

"注：目前只支持部署 goagent Python 版本服务端到 Google App Engine（http://appengine.google.com/）。\n\n完成配置后请进入“状态”标签开始部署。" = "Only supports deploy goagent to Google App Engine now.";

"goagent 服务端" = "goagent server";

"西厢" = "west chabmer";

"远程 DNS 地址：" = "Remote DNS:";

"用于解析域名的 DNS" = "Remote DNS Server";

"goagent 服务：" = "goagent server:";

"goagent 密码：" = "goagent password:";

"导入 goagent 根证书" = "Import goagent CA";

"默认情况下，访问 HTTPS 网站会提示证书错误，导入证书可以解决这个问题。导入后请修改证书信任设置中“加密套接字协议层（SSL）”为“总是信任”。\n注意：导入 goagent 根证书会有安全隐患，有可能会导致中间人攻击，请谨慎使用。" = "Import goagent CA to resolve certificates error when visit HTTPS sites.\nNotice: Import goagent CA will cause security risk, such as middle-man attack, use as your own risk.";

"用于例外情况时获取网页内容的代理服务器" = "Used for get web page content";

"goagent 服务密码" = "goagent server password";

"一般情况下，本页配置无需更改。如果需要修改，请明白各选项的作用。" = "Usually it does not need modify settings on this page";

"服务器地址：" = "Server Address";

"服务端端口：" = "Server Port";

"本地监听的端口，需大于 1024，默认为 7070" = "Local listen port, need greater than 1024, default is 7070";

"SSH 服务器地址" = "SSH Server Address";

"默认端口为 22" = "Default Port is 22";

"允许非本机使用" = "Share Service to Local Network";

"登录 SSH 服务器所用的用户名" = "Username for connecting to SSH Server";

"SSH 账号密码，如果使用 Public Key 登录，可以不填" = "Password of SSH account, if login with Public Key please leave blank";

"使用 Public Key 代替密码登录" = "Login with Public Key";

"自定义 SSH 私钥文件：" = "Custom Private Key:";

"不使用默认 ~/.ssh 下的私钥，自定义私钥文件" = "Use custom private key instead of ~/.ssh";

"本地监听的端口，需大于 1024，默认为 8080" = "Local listen port, needs greater than 1024, default is 8800";

"使用服务器：" = "Use Server:";

"SSL 版本：" = "SSL Version:";

"所有版本" = "All Versions";

"服务器列表：" = "Server List:";

"显示示例" = "Show Example";

"每行一个服务器地址，请按以下格式填写：\n本地端口 : 远程服务器 : 远程服务器端口\n其中本地端口可以省略（省略时将会从上面设置的本地端口顺序增加，如 8801）。\n如果需要分隔为多个 service，请使用空行分隔。" = "Every server address each line, example:\nLocal Port:Remote Server:Remote Port\nLocal Port is optional (If omitted Local Port will be increased by Local Port above, such as 8801).\nIf needs seperate to multiple service, seperate servers with blank line.";

"ShadowSocks 服务器地址" = "ShadowSocks Server Address";

"本地监听的端口，需大于 1024" = "Local listen port, needs greater than 1024";

"ShadowSocks 服务器监听端口" = "ShadowSocks Server Listen Port";

"ShadowSocks 超时设置" = "ShadowSocks Timeout Setting";

"连接超时（秒）：" = "Timeout (Seconds):";

"ShadowSocks 服务密码" = "ShadowSocks Service Password";

"加密方式：" = "Encrypt Method:";

"table（默认）" = "table (Default)";

"服务端部署请到 https://github.com/clowwindy/shadowsocks 获取" = "Get server code from https://github.com/clowwindy/shadowsocks";

"启动成功修改系统代理设置为“全局通过代理访问”" = "Modify system proxy setting to \"Use as System Global Proxy\"";

"启动成功后修改系统代理设置为“自动代理配置（PAC）”" = "Modify system porxy setting to Use \"Automatic Proxy Configuration (PAC)\"";

"需要与相关扩展（例如 SwitchySharp）配合使用。" = "Use with other extensions (SwitchSharp etc.)";

"只有在 PAC 文件和自定义 PAC 域名列表中的网站才会通过代理访问。" = "Only domains in PAC or Custom PAC Domains List will access through proxy";

"PAC 服务使用固定端口：" = "Fixed PAC Service Port:";

"当前内置 PAC 服务地址：" = "Current PAC Address:";

"使用自定义 PAC 地址：" = "Custom PAC Address:";

"例如 http://example.com/proxy.pac" = "For example: http://example.com/proxy.pac";

"如 9999" = "Such as 9999";

"自定义 PAC 域名列表" = "Custom PAC Domains List";

"输入需要通过 GoAgentX 访问的域名列表，每行一个，支持通配符 *，例如 *.google.com 。在修改完域名列表后，需要应用后才会生效。" = "Input domains need access through proxy, one site each line, supports Wildcard, for example: *.google.com\nMust Apply after edit for making effective.";

"应\n用" = "Apply";

"需要重新启动本程序来生效" = "Needs restart GoAgentX";

"自动启动" = "AutoStart";

"在用户登录时自动启动 GoAgentX" = "Auto start GoAgentX after login";

"在用户第一次登录进入 Mac OS X 时，自动运行 GoAgentX" = "Auto start GoAgentX when user logged in";

"goagent 根证书" = "goagent CA";

"其他" = "Others";

"GoAgentX 窗口总是置顶" = "Make GoAgnetX's main window always on top";

"服务状态改变通知" = "Send Service Status Changed Notification";

"停止" = "Stop";

"启动" = "Start";

"清除日志" = "Clear Logs";

"日志：" = "Logs:";

"正在运行" = "is running";

"，端口 %d" = ", port %d";

"已停止" = "stopped";

"停止重连" = "Stop Reconnect";

"Stunnel 服务器列表示例" = "Stunnel Server List Example";

"西厢第3季" = "west-chamber-season-3";

"goagent 服务端部署" = "goagent Server Deploy";

"goagent 更新" = "goagent Update";

"请进行服务配置" = "Please configure service first";

"正在启动" = "Starting";

"启动完成" = "Start finished";

"服务器端口：" = "Server Port:";

"混淆密钥：" = "Obfuscate Keyword:";

"混淆密钥，用于支持混淆的 SSH 服务器" = "Keyword used to connecting obfuscated SSH server";